DataProcessors/Удалить_кпкОчисткаТрековЗаПериод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>Удалить_кпкОчисткаТрековЗаПериод</Name>
			<Comment>Очистка треков перемещений за период</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаАгентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Агент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Агенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/Удалить_кпкОчисткаТрековЗаПериод/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
 
Процедура ЗаполнитьТаблицуАгентов() Экспорт
	
	ТаблицаАгентов.Очистить();
	
	ВыборкаРегистра = РегистрыСведений.кпкСведенияАгента.Выбрать();
	
	Пока ВыборкаРегистра.Следующий() Цикл
		
		СтрАгента 		  = ТаблицаАгентов.Добавить();
		СтрАгента.Агент   = ВыборкаРегистра.Объект;
		СтрАгента.Пометка = Истина;
		
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьТаблицуАгентов()

Процедура ВыполнитьОчисткуТреков() Экспорт

	МассивАгентов = ТаблицаАгентов.ВыгрузитьКолонку("Агент");
	СписАгентов = Новый СписокЗначений;
	
	Для Каждого СтрокаМас Из МассивАгентов Цикл
		СписАгентов.Добавить(СтрокаМас);	
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	кпкСведенияПоГПСТрекам.Период,
	|	кпкСведенияПоГПСТрекам.Агент,
	|	кпкСведенияПоГПСТрекам.ДатаСоздания,
	|	кпкСведенияПоГПСТрекам.Широта,
	|	кпкСведенияПоГПСТрекам.Долгота,
	|	кпкСведенияПоГПСТрекам.Ключ
	|ИЗ
	|	РегистрСведений.кпкСведенияПоГПСТрекам КАК кпкСведенияПоГПСТрекам
	|ГДЕ
	|	кпкСведенияПоГПСТрекам.Период МЕЖДУ &НачПериод И &КонПериод
	|	И кпкСведенияПоГПСТрекам.Агент В(&СписокАгентов)");
	
	Запрос.УстановитьПараметр("НачПериод", 	   НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонПериод", 	   КонецДня(КонПериода));
	Запрос.УстановитьПараметр("СписокАгентов", СписАгентов);
	
	ВыборкаГПС = Запрос.Выполнить().Выбрать();
 
	Менеджер = РегистрыСведений.кпкСведенияПоГПСТрекам.СоздатьМенеджерЗаписи();
	
	Пока ВыборкаГПС.Следующий() Цикл
		Менеджер.Период       = ВыборкаГПС.Период;
		Менеджер.Агент        = ВыборкаГПС.Агент;
		Менеджер.Ключ         = ВыборкаГПС.Ключ;
		Менеджер.Прочитать();
		
		Если Менеджер.Выбран() Тогда
			Менеджер.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ВыполнитьОчисткуТреков()
